Aghosh993/Trinity2013/STM32F3x/src/main.cpp
#include "stm32f30x_adc.h"
#include "stm32f30x_gpio.h"
#include "stm32f30x_dma.h"

#include "stm32f3_discovery_l3gd20.h"

#include "encoder.h"
#include "pwm.h"
#include "debug.h"

#include <stdio.h>
#include <stdint.h>
#include <math.h>

/*
 * Timer usage manifest:
 *
 * TIM1: 16-bit PWM output mode (PE14) [for BLDC control...]
 * TIM2: 32-bit encoder interface input (PC6, PC7) (NOT ON TRINITY BOARD DUE TO HARDWARE FAULT!!)
 *
 * TIM3: PWM Output Channels 1 and 2 	(PB4, PB5)
 *
 * TIM4: 16-bit encoder interface input (PD12, PD13) (ONLY ON TRINITY BOARD, DUE TO ABOVE!!)
 *
 * TIM6: LED matrix ISR
 * TIM7: Encoder update ISR
 *
 * TIM8: 16-bit encoder interface input (PA0, PA1)
 *
 *
 * TIM17: IMU update ISR
 *
 * Other pins/resources used:
 *
 * Analog: 	PA2: adcData[0]
 * 			PA3: adcData[1]
 *
 * 			PA4: adc2_data[0]
 * 			PC4: adc2_data[1]
 * 			PC5: adc2_data[2]
 * 			PB2: adc2_data[3]
 *
 * Digital:
 *
 * Debug port information: Baud Rate=115200, 8n1 UART (TTL pins PA9, PA10)
 * 							PA9 = TX, PA10 = RX (W/respect to STM32 device)
 *
 * Purpose: Trinity 2013 (Theseus) Primary code development tree
 *
 */

/*
 * ADC TODO: Use PF4 for third channel in DMA setup for ADC1, then attempt to get DMA + continuous
 * conversion up and running in ADC3...? (Need more detailed datasheet reference...)
 */

volatile int led_iter;
volatile int led_matrix[7] = {GPIO_Pin_9, GPIO_Pin_8, GPIO_Pin_15, GPIO_Pin_13,
										GPIO_Pin_12, GPIO_Pin_11, GPIO_Pin_10};

void imu_update_ISR_init(void);
int16_t calc_gyro_bias(void);

uint32_t L3GD20_TIMEOUT_UserCallback(void);

void adc1_init_DMA(void);
void adc2_init_DMA(void);
void battery_watchdog_init(void);
void adc1_init(void);

void brake_pins_init(void);

void ping_pin_init(void);
void timer2_timebase_init(void);

void comp_init(void);

void trinity2013_waitForStart(void);

float IR_distance(int IR_ADC_VAL);

// Global variables to keep track of encoders and inertial sensors:

encoderState left_enc, right_enc;

volatile float gyro_angle_x;
int gyro_bias_x, adcval;

__IO uint32_t adcData[2];
int new_data;

__IO uint32_t adc2_data[4];
uint8_t adc2_new_data;

uint8_t adc3_awd1, adc3_awd2;

int count, stage;

float drive_cmd;// = 0.0f;
float err;// = 0.0f;
float last_err;// = 0.0f;
float diff_err;
float rt;// = 0.0f;
float d_front;// = 1.0f;
float integral;

float left, right;

int state;

// Initialize all encoder data structures to zero:

int main(void)
{
	SystemInit(); // Set up clocks/PLL/et. al

	UART1_init(); // Debug bridge

	state = ST_READY;

	LED_MATRIX_ISR_init();

	trinity2013_waitForStart();

	state = ST_WANDER;

	// Initialize ADC data buffers to 0;

	adcData[0] = 0;
	adcData[1] = 0;

	uint8_t iter = 0;
	for(iter=0; iter < 7; ++iter)
	{
		adc2_data[iter] = 0;
	}

	adc3_awd1 = 0;
	adc3_awd2 = 0;

	count = 0;
	stage = 0;

	/*
	 * Initialize global encoder data structure for left and right encoders,
	 * and set position/speed targets as necessary:
	 */

	init_encoder_struct(&left_enc);
	init_encoder_struct(&right_enc);

	// Initialize PWM outputs 1 and 2 at 5.0 kHz duty frequency:

	brake_pins_init();
	pwm_out1_init(2000);
	pwm_out2_init(2000);

	pwm_out3_init(50);

	// Initialize hardware quadrature encoder input interfaces:

	TIM8_init_encoder();
	TIM4_init_encoder();

	// Initialize ADC, encoder update, IMU update and LED matrix interrupts:

	new_data = 0;
	adc2_new_data = 0;

	// Initialize ADC1 DMA:
	adc1_init_DMA();

	// Initialize ADC2 DMA:
	adc2_init_DMA();

	//	battery_watchdog_init();

	encoder_update_ISR_init();	//Update the state of the two encoders (left/right)

	// Ping Sensor Init:

	ping_pin_init();
	timer2_timebase_init();
	imu_update_ISR_init();

	// Encoder comparator init for noise debounce:
	comp_init();

	adcval = 0;

	drive_cmd = 0.0f;
	err = 0.0f;
	last_err = 0.0f;
	diff_err = 0.0f;
	rt = 0.0f;
	d_front = 1.0f;
	integral = 0.0f;

	int uv_avgBuf1 = 0;
	int uv_avgBuf2 = 0;
	int uv_iter = 0;

	float uv1_avg, uv2_avg;

	LED_MATRIX_ISR_init();		//Hand out some eye candy while we're at it...

	while(true)
	{
		printf("%4d %4d %4d\n\r", (int)adcData[0] , (int)adc2_data[2], ((int)adcData[0] - (int)adc2_data[2]));
		if(((adc2_data[2] > 500 || adcData[0] > 500)) && state == ST_WANDER)
		{
			for(uv_iter=0; uv_iter<300; ++uv_iter)
			{
				uv_avgBuf1 += (int)adcData[0];
				uv_avgBuf2 += (int)adc2_data[2];
			}
			uv1_avg = (float)uv_avgBuf1/(float)300;
			uv2_avg = (float)uv_avgBuf2/(float)300;

			if(uv1_avg > 500.00 || uv2_avg > 500.00)
			{
				state = ST_HOMING;
			}

		}
		else if (state == ST_FIREFIGHT)
		{
			pwm1_output(0.5);
			pwm2_output(0.5);
			int jk = 0;
			for(jk=0;jk<1250000;++jk)
			{
				pwm3_output(0.06f);
			}
			pwm3_output(0.1f);
			state = ST_DONE;
		}

	}
	return 0; // We should never manage to get here...
}

void trinity2013_waitForStart(void)
{
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOD, ENABLE);
	GPIO_DeInit(GPIOD);
	GPIO_InitTypeDef g;
	g.GPIO_Mode = GPIO_Mode_IN;
	g.GPIO_OType = GPIO_OType_OD;
	g.GPIO_Pin = GPIO_Pin_3;
	g.GPIO_PuPd = GPIO_PuPd_DOWN;
//	g.GPIO_Speed = GPIO_Speed_Level_2;
	GPIO_Init(GPIOD,&g);

	while(GPIO_ReadInputDataBit(GPIOD, GPIO_Pin_3) == (uint8_t)Bit_RESET);
	state = ST_WANDER;
//	while(!(GPIOD->IDR & GPIO_Pin));

	/*
	 * {
		if(GPIO_ReadInputDataBit(GPIOC, 11) == Bit_SET)
		{
			int i = 0;
			for(i=0; i< 10000;++i)
			{
				if(GPIO_ReadInputDataBit(GPIOC, 11) == Bit_SET)
				{
					break;
				}
			}
			return;
		}
	}
	 */


}

float IR_distance(int IR_ADC_VAL)
{
	float v_sensor_actual = (float)0.0008698 * (float)IR_ADC_VAL;
	return (((float)0.632)*((float)pow(v_sensor_actual,6))-((float)8.012)*((float)pow(v_sensor_actual,5))
			+ ((float)41.05)*((float)pow(v_sensor_actual,4)) - ((float)109.7)*((float)pow(v_sensor_actual,3))
			+ ((float)164.7)*((float)pow(v_sensor_actual,2)) - (((float)138.8)*(float)v_sensor_actual)
			+ (float)60.24);
}

// Initializes the ISR that reads inertial sensors (gyro + accelerometer)
// Interrupt priority is HIGHEST (0)

void imu_update_ISR_init(void)
{
	L3GD20_InitTypeDef l3gInit;

